//CLARKEE  JOB A,CLARKE,NOTIFY=CLARKE,MSGLEVEL=1,REGION=4048K,
// MSGCLASS=X
//COMP1 EXEC PGM=COMPSYSG
//SYSPRINT DD SYSOUT=*,OUTLIM=2500
//SYSUT2   DD SYSOUT=*,OUTLIM=2500
//SYSIN  DD DUMMY
//SYSUT1 DD DSN=CLARKE.JOL40.ASM(UJP00CHR),DISP=SHR
//SYSABEND DD SYSOUT=*
