//CLARKE1 JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE
//DEL EXEC PGM=IEFBR14,PARM='NODECK,TERM,OBJ,XREF(SHORT),LIST'
//SYSUT3   DD  DSN=CLARKE.TEST.YYY,
// DISP=(OLD,DELETE)
//ASM EXEC PGM=IEFBR14,PARM='NODECK,TERM,OBJ,XREF(SHORT),LIST'
//SYSUT3   DD  DSN=CLARKE.TEST.YYY,SPACE=(TRK,(1,0)),UNIT=SYSDA,
// DISP=(,CATLG),VOL=SER=(CADAM2,F4A300,F4EDU3,F4T300,F4W300,
//       PROJ01)
