//CLARKE1 JOB (R777),'CVC',MSGCLASS=X,NOTIFY=CLARKE
//COMP1 EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=X
//COMP   DD DSN=CLARKE.JOL40.ASM,DISP=SHR
  COPY I=COMP,O=COMP
