//CLARKEE  JOB A,CLARKE,NOTIFY=CLARKE,MSGLEVEL=1,REGION=4048K,
// MSGCLASS=X
//COMP PROC
//COMP1 EXEC PGM=COMPSYSG
//STEPLIB DD DSN=CLARKE.JOL40.LOAD,DISP=(SHR,PASS)
//SYSPRINT DD SYSOUT=X,OUTLIM=2500
//OLDSYS DD DSN=CLARKE.JOL40.ASM($JOLSH35),DISP=SHR
//NEWSYS DD DSN=CLARKE.JOL40.ASM($JOLSH40),DISP=SHR
//*NEWSYS DD DSN=CLARKE.JOL40.OLD.BACKUP.ASM($JOLCP35),DISP=SHR
// PEND
// EXEC COMP
