//CLARKEE  JOB A,CLARKE,NOTIFY=CLARKE,MSGLEVEL=1,REGION=4048K,
// MSGCLASS=X
//COMP PROC  M=
//COMP1 EXEC PGM=COMPSYSG
//STEPLIB DD DSN=CLARKE.JOL40.LOAD,DISP=(SHR,PASS)
//SYSPRINT DD SYSOUT=X,OUTLIM=2500
//OLDSYS DD DSN=CLARKE.JOL40.MACLIB(&M),DISP=(SHR,PASS)
//NEWSYS DD DSN=CLARKE.JOL50.MACLIB(&M1),DISP=(SHR,PASS)
// PEND
// EXEC COMP,M=JOLCOMM,M1=JOLCOMM
