//CLARKED  JOB MSGCLASS=X,NOTIFY=CLARKE
//         EXEC PGM=LIBE
//STEPLIB   DD   DSN=SYS2.FTOOLS,DISP=SHR
//PRINT DD   SYSOUT=*
//LIST DD   SYSOUT=*
//FILE1I   DD   DSN=CLARKE.JOL34.ASM,DISP=SHR
//FILE1O   DD   DSN=CLARKE.DJD4.ASM,DISP=SHR
//COIN     DD   *
/  COMPARE +,IN=FILE1I,COMP=FILE1O,LIMIT=1
/  FIN
//         EXEC PGM=LIBE
//STEPLIB   DD   DSN=SYS2.FTOOLS,DISP=SHR
//PRINT DD   SYSOUT=*
//LIST DD   SYSOUT=*
//FILE1I   DD   DSN=CLARKE.JOL34.ASM,DISP=SHR
//FILE1O   DD   DSN=CLARKE.DJD4.ASM,DISP=SHR
//COIN     DD   *
/  COMPARE +,IN=FILE1O,COMP=FILE1I,LIMIT=1
/  FIN
//
