//CLARKEE  JOB A,CLARKE,NOTIFY=CLARKE,MSGLEVEL=1,REGION=4048K,
// MSGCLASS=X
//COMP PROC  M=
//COMP1 EXEC PGM=COMPSYSG
//STEPLIB DD DSN=CLARKE.JOL35.LOAD,DISP=(SHR,PASS)
//SYSPRINT DD SYSOUT=X,OUTLIM=9000
//OLDSYS DD DSN=CLARKE.JOL35.ASM(&M),DISP=(SHR,PASS)
//NEWSYS DD DSN=CLARKE.JOL35.ASM(&M1),DISP=(SHR,PASS)
// PEND
// EXEC COMP,M=$CHCX8SH,M1=$JOLSH35
