//CLARKEF JOB (XXXX),CVC,MSGCLASS=X,NOTIFY=CLARKE
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN15     DD  DSN=CLARKE.JOL35.LOAD,DISP=OLD
//SYSIN DD *
 C I=IN15,O=IN15
/*
