//CLARKEA JOB (XXXX),CVC,MSGCLASS=X,NOTIFY=CLARKE
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN1      DD  DSN=CLARKE.JOL40.CMDLIB,DISP=SHR
//IN2      DD  DSN=CLARKE.JOL60.CMDLIB,DISP=SHR
//OUTFULL  DD  DSN=CLARKE.JOL60.CMDLIBB,DISP=SHR
//SYSIN DD *
 C I=IN2,O=OUTFULL
 C I=IN1,O=OUTFULL
/*
