//CLARKE2 JOB (0000,0000),NAME,NOTIFY=CLARKE,REGION=1024K,
// MSGCLASS=X TYPRUN=SCAN
//COPYSYS  EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=X
//LOADOUT  DD  DISP=SHR,DSN=CLARKE.JOL60.CVCLKED
//LOADIN   DD  DISP=SHR,DSN=CLARKEO.JOL40.CVCLKED
//SYSIN  DD *
   COPY INDD=LOADIN,OUTDD=LOADOUT
//
