//CLARKEF JOB (XXXX),CVC,MSGCLASS=X
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN       DD  DSN=JOL.DJD3.ASM,DISP=(SHR,PASS),
// VOL=SER=JOLBUP,LABEL=6,UNIT=TAPE
//OUT      DD  DSN=CLARKE.DJD3.ASM,DISP=SHR
//SYSIN DD *
 C I=IN,O=OUT
/*
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN       DD  DSN=JOL.DJD4.ASM,DISP=(SHR,PASS),
// VOL=SER=JOLBUP,LABEL=7,UNIT=TAPE
//OUT      DD  DSN=CLARKE.DJD4.ASM,DISP=SHR
//SYSIN DD *
 C I=IN,O=OUT
/*
