//CLARKEF JOB (XXXX),CVC,MSGCLASS=A,NOTIFY=CLARKE
//        EXEC PGM=IEFBR14
//*DEL1    DD  DSN=CLARKE.JOL40.CNTL2,DISP=(OLD,DELETE)
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN1      DD  DSN=CLARKE.JOL40.CNTL,DISP=SHR    ,UNIT=TAPE,
//*        VOL=SER=AD0673,LABEL=(3,SL)
//OUT1     DD  DSN=CLARKE.JOL40.CNTL3,DISP=(NEW,CATLG),UNIT=DISK,
// VOL=SER=JOL53,SPACE=(CYL,(2,1,80),RLSE)
//SYSIN DD *
 C I=IN1,O=OUT1
/*
