//MEL371C JOB (1011,1011),CLARKE,MSGCLASS=X,NOTIFY=MEL371
// EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
   DELETE MEL371 ALIAS
   DEFINE ALIAS (NAME(MEL371) RELATE(SYS1.UCAT.PROJ01)
