//CLARKEA JOB (CVC),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LIST EXEC PGM=IEBPTPCH
//SYSPRINT DD SYSOUT=*
//SYSUT2 DD DSN=CLARKE.TOPC.J51ASM,DISP=(,CATLG),
// SPACE=(CYL,(30,10),RLSE),DCB=(RECFM=FB,LRECL=81,BLKSIZE=4050),
// UNIT=SYSDA
//SYSUT1 DD DISP=SHR,DSN=CLARKE.JOL51.ASM
//SYSIN DD *
 PUNCH TYPORG=PO
