//CLARKEI JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE
//ASM EXEC PGM=IEHPROGM
//SYSPRINT DD  SYSOUT=*
 UNCATLG DSNAME=CLARKE.TEST.YYY
 UNCATLG DSNAME=CLARKE.TEMP.YYY
 UNCATLG DSNAME=CLARKE.TEST.XXX
 CATLG DSNAME=CLARKE.TEST.YYY,VOL=SYSDA=(HALWRK,MTCSYS,WORK02,F4S3DA, ++
               F4S3DB,ANLDEV,CAODEV)
