//CLARKET  JOB CLASS=A,MSGCLASS=A,NOTIFY=CLARKE
//INITT   EXEC PGM=JSGINITT
//SYSPRINT  DD SYSOUT=*
//TAPE      DD UNIT=(TAPE,1,DEFER)
//SYSIN     DD *
TAPE     INITT SER=J40FVR
/*
//
