//CLARKE1 JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='XREF,LIST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL40.OBJ,DISP=OLD
//SYSLIB2   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(UJE99DTA)
  INCLUDE SYSLIB1(UJE01CAT)
  INCLUDE SYSLIB2($JOLIN40)
  ENTRY   UJEINIT
  NAME $JOLIN40(R)
