//CLARKEA  JOB MSGCLASS=X,NOTIFY=CLARKE
//         EXEC PGM=LIBE
//STEPLIB   DD   DSN=SYS2.FTOOLS,DISP=SHR
//PRINT DD   SYSOUT=A
//LIST DD   SYSOUT=A
//FILE1    DD   DSN=CLARKE.VRTEMP.JOL,DISP=SHR
//FILE3    DD   VOL=SER=X8JOL,UNIT=TAPE,DSN=VRTJOL,DISP=(NEW,PASS)
//COIN     DD   *
/  BACKUP  +,IN=FILE1,OUT=FILE3,FILE=VRTJOL
/  FIN
//
