//CLARKEL JOB (CLARKE),CAST,MSGCLASS=X,NOTIFY=JOL60
//LKED    EXEC PGM=IEWL,PARM='REUS,XREF,LIST,AC=0,TEST',
// REGION=2048K
//SYSLIB    DD DSN=JOLDEV.JOL60.OBJ,DISP=SHR
//SYSLMOD   DD DSN=JOLDIST.JOL60.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB(SHOWDBF)
  ALIAS SHOWDSN
  ALIAS SHOWMEM
  NAME SHOWDBF(R)
