//CLARKEL JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=JOL60
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST,LET,TEST',
// REGION=4096K
//SYSLIB3   DD DSN=JOLDEV.JOL60.OBJ,DISP=SHR
//SYSLIB    DD DSN=JOLDEV.JOL60.OBJ,DISP=SHR
//SYSLMOD   DD DSN=JOLDIST.JOL60.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD DISP=SHR,DSN=JOLDEV.JOL60.LINKLIST($JOLCP60)
//SYSLIN    DD *
  INCLUDE SYSLIB3($JOLCP60)
* INCLUDE SYSLIB3(UJI00MN)
* INCLUDE SYSLIB3(UJI01DAL)
  INCLUDE SYSLIB3(PREPROC)
  INCLUDE SYSLIB3(UJPCOLOR)
  INCLUDE SYSLIB3(PJOLINST)
  INCLUDE SYSLIB3(ALLOCATE)
  INCLUDE SYSLIB3(EXIT)
  INCLUDE SYSLIB3(UJD03DS)
  INCLUDE SYSLIB3(PREPSUBS)
  INCLUDE SYSLIB3(PRINTSYM)
  INCLUDE SYSLIB3(UJP17FRE)
  INCLUDE SYSLIB3(P18)
  INCLUDE SYSLIB3(FIXPARS)
  INCLUDE SYSLIB3(GETSYM)
  INCLUDE SYSLIB3(STORESYM)
* INCLUDE SYSLIB3(SHOWDBF)
  INCLUDE SYSLIB3(REDO)
  INCLUDE SYSLIB3(UJP01LIB)
  INCLUDE SYSLIB3(UJP17OPN)
  INCLUDE SYSLIB3(UJP26ENQ)
  INCLUDE SYSLIB3(UJP26DEQ)
  INCLUDE SYSLIB3(P27INIT)
  INCLUDE SYSLIB3(P27NEW)
  INCLUDE SYSLIB3(P27PRMS)
  INCLUDE SYSLIB3(P27POP)
  INCLUDE SYSLIB3(P27MBAR)
  INCLUDE SYSLIB3(P27PRMS)
  INCLUDE SYSLIB3(P27TBA)
  INCLUDE SYSLIB3(P27GETXT)
  INCLUDE SYSLIB3(UJP93DTE)
  INCLUDE SYSLIB3(UJP05ADD)
  INCLUDE SYSLIB3(UJP05DBF)
  INCLUDE SYSLIB3(UJP95INI)
  INCLUDE SYSLIB3(UJC00MN)
  INCLUDE SYSLIB3(CJOLINST)
  INCLUDE SYSLIB3(UJC01JOB)
  INCLUDE SYSLIB3(UJC01LIB)
  INCLUDE SYSLIB3(UJC02PGM)
  INCLUDE SYSLIB3(UJC03DS)
  INCLUDE SYSLIB3(UJC05CAT)
  INCLUDE SYSLIB3(UJC24DB)
  INCLUDE SYSLIB3(UJC90OP)
  INCLUDE SYSLIB3(COMPSUBS)
  INCLUDE SYSLIB3(UJV00MN)
  INCLUDE SYSLIB3(UJV00RD)
  INCLUDE SYSLIB3(UJO39GDG)
  INCLUDE SYSLIB3(US26ENQ)
  INCLUDE SYSLIB3(UJG26ENQ)
  INCLUDE SYSLIB3(UJG00MN)
  INCLUDE SYSLIB3(UJG01JOB)
  INCLUDE SYSLIB3(UJF00MN)
  INCLUDE SYSLIB3(VSAMIO)
  INCLUDE SYSLIB3(UJS02XA)
  INCLUDE SYSLIB3(UJS03CTS)
  INCLUDE SYSLIB3(UJS03UCT)
  ENTRY $JOLCP60
  NAME $JOLCP60(R)
