//CLARKEL JOB (CLARKE),CAST,MSGCLASS=X,NOTIFY=JOL60
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST,AC=1',
// REGION=2048K
//SYSLIB    DD DSN=JOLDEV.JOL60.OBJ,DISP=SHR
//SYSLMOD   DD DSN=JOLDIST.JOL60.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB($JOLMN60)
  NAME  $MONIT60(R)
