//CLARKE6 JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//JOL35OBJ  DD DSN=CLARKE.JOL.OBJ,DISP=OLD
//JOL36OBJ  DD DSN=CLARKE.JOL36.OBJ,DISP=OLD
//JOL35LOD  DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE JOL35OBJ(PREPROC)
  INCLUDE JOL35OBJ(PJOLINST)
  INCLUDE JOL35OBJ(REDO)
  INCLUDE JOL36OBJ(UJP17OPN)
  INCLUDE JOL35OBJ(UJP17FRE)
  INCLUDE JOL36OBJ(UJP26DEQ)
  INCLUDE JOL36OBJ(UJP26ENQ)
  INCLUDE JOL35OBJ(UJP93DTE)
  INCLUDE JOL35OBJ(UJP94INI)
  INCLUDE JOL35OBJ(UJP95INI)
  INCLUDE JOL36OBJ(JOLENQ)
  INCLUDE JOL35LOD(OLDP00)
  ENTRY UJP00MN
  NAME  UJP00SML(R)
  INCLUDE JOL35OBJ(ALLOCATE)
  INCLUDE JOL35OBJ(UJD03DS)
  INCLUDE JOL35LOD(ALL3)
  ALIAS ALLOC
  NAME  ALLOCATE(R)
