//CLARKE1 JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//JOL35OBJ  DD DSN=CLARKE.JOL.OBJ,DISP=OLD
//JOL40OBJ  DD DSN=CLARKE.JOL40.OBJ,DISP=OLD
//JOL35LOD  DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSLIB    DD DSN=CLARKE.JOL40.OBJ,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE JOL40OBJ(UJP56CAL)
  INCLUDE SYSLMOD(UJP00MN)
  ORDER  UJP00MN
  PAGE  UJP00MN
  NAME  UJP00MN(R)
