//CLARKE6 JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL36.OBJ,DISP=OLD
//SYSLIB2   DD DSN=CLARKE.JOL34.LOAD,DISP=SHR
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL36.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(UJP26ENQ)
  INCLUDE SYSLIB1(JOLENQ)
  ALIAS ENQ
  NAME  UJP26ENQ(R)
  INCLUDE SYSLIB1(UJP26DEQ)
  INCLUDE SYSLIB1(JOLENQ)
  ALIAS DEQ
  NAME  UJP26DEQ(R)
