//CLARKEX JOB (ACCOUNT),CLARKE,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST,TEST',REGION=512K
//SYSLIB    DD DSN=CLARKE.JOL40.OBJ,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB(P27POP)
  INCLUDE SYSLIB(P27INIT)
  INCLUDE SYSLIB(P27GETXT)
  ENTRY  UJP27POP
  NAME P27POP(R)
