//CLARKEL JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='XREF,LIST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(NOTHING)
  SETSSI  01234567
  NAME TESTSSI1(R)
  INCLUDE SYSLIB1(NOTHING)
  NAME TESTSSI2(R)
  INCLUDE SYSLIB1(NOTHING)
  SETSSI  01234567
  ALIAS TESTSSA1
  NAME TESTSSI3(R)
  INCLUDE SYSLIB1(NOTHING)
  ALIAS TESTSSA2
  NAME TESTSSI4(R)
