//CLARKE6 JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//OBJ       DD DSN=CLARKE.JOL60.OBJ,DISP=OLD
//OBJ40     DD DSN=CLARKE.JOL40.OBJ,DISP=OLD
//*SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL60.LOAD,DISP=SHR
//SYSOLD    DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE OBJ(UJV00MN)
  INCLUDE OBJ40(UJS02XA)
  INCLUDE OBJ(UJO39GDG)
  INCLUDE SYSOLD(UJV00MN)
  ENTRY UJV00MN
  NAME  UJV00MNX(R)
//SYSXXX    DD *
