//CLARKEL JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='XREF,LIST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL.OBJ,DISP=OLD
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL34.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(UJY10AL)
  ALIAS UJY11OP,UJY12END
  NAME UJY10AL(R)
