//       EXEC PGM=JSGMTCPY
//SYSUT1   DD UNIT=TAPE,DISP=OLD,LABEL=(,BLP),VOL=SER=INPUT
//SYSUT2 DD UNIT=TAPE,DISP=NEW,LABEL=(,BLP),VOL=SER=OUTPUT,DCB=DEN=3
//SYSPRINT DD SYSOUT=A
/*
