//CLARKED JOB CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1) TYPRUN=HOLD
//       EXEC PGM=JSGMTCPY
//SYSUT1   DD UNIT=290,DISP=OLD,LABEL=(,BLP),VOL=SER=INPUT
//SYSUT2   DD UNIT=291,DISP=NEW,LABEL=(,BLP),VOL=SER=OUTPUT
//* DCB=DEN=3
//SYSPRINT DD SYSOUT=*
/*
