//CLARKEP  JOB (0000,0000),NAME,MSGCLASS=X,NOTIFY=CLARKE
// EXEC PLIXCL,REGION=1500K,
// PARM='M,MARGINS(2,72,1),NEST,SOURCE,MDECK,INSOURCE,NOCOMPILE'
//SYSPRINT DD SYSOUT=*
//SYSIN DD DSN=CLARKE.JOL40.SOURCE(JCLTOJOL),DISP=SHR
//SYSPUNCH DD SYSOUT=*
//LKED.SYSLMOD DD DUMMY
//LKED.SYSLMOD DD DSN=SYS2.JOL40.LOAD(JCLTOJOL),DISP=SHR
//SYSPRINT DD SYSOUT=*
