//CLARKEB  JOB (0000,0000),CVC,MSGCLASS=X,NOTIFY=CLARKE
//*JOBCAT DD DSN=SYS1.PROJ01.UCAT,DISP=SHR
// EXEC PLIXCLG,
// PARM=('MARGINS(1,80,0),NEST,OBJ,SOURCE,LIST,MAP,NOGOSTMT,STMT',
// ',COMPILE,OPT(3),SPACE'),REGION=300K
//SYSPRINT DD SYSOUT=*
//*SYSPRINT DD DSN=CLARKE.PLI.PRN,DISP=(,CATLG),
//*  SPACE=(CYL,(5,1),RLSE),DCB=BLKSIZE=1330,UNIT=SYSDA
//SYSLIB DD DSN=CLARKE.JOL40.NEW2.PLI,DISP=SHR
//SYSIN  DD DSN=CLARKE.JOL40.NEW2.PLI(P18PARSE),DISP=SHR
