//CLARKEF JOB (XXXX),CVC,MSGCLASS=X,NOTIFY=CLARKE
//        EXEC PGM=IEFBR14
//SYSPRINT DD  SYSOUT=*
//IN       DD  DSN=CLARKE.JOL35.SCHED,UNIT=SYSDA,VOL=SER=F4S9AC,
// DISP=(SHR,CATLG)
//IN       DD  DSN=CLARKE.JOL35.SCHED2,UNIT=SYSDA,VOL=SER=F4S9AC,
// DISP=(SHR,CATLG)
//IN       DD  DSN=CLARKE.SCHED.LIST,UNIT=SYSDA,VOL=SER=WORK02,
// DISP=(SHR,CATLG)
