//CLARKEA JOB (FXA4,C9GB),CLARKE,NOTIFY=CLARKE, TYPRUN=HOLD,
//             REGION=1024K,PRTY=8,
//             MSGCLASS=X
/*JOBPARM LINECT=0
//REST40 PROC L=
//COPY EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD DSN=JOL40.ASM,DISP=(SHR,PASS), DCB=DEN=3,
// VOL=SER=CVCJ40,UNIT=TAPE,LABEL=&L
//SYSUT2 DD DSN=CLARKE.JOL402.ASM,DISP=SHR
// PEND
//S12 EXEC REST40,L=12
  C I=SYSUT1,O=SYSUT2
  S M=UJC00MN
