//CLARKEE  JOB A,CLARKE,NOTIFY=CLARKE,MSGLEVEL=1,
// MSGCLASS=X
//COMP1 EXEC PGM=IEHPROGM
//SYSPRINT DD SYSOUT=X,OUTLIM=2500
//OLDSYS DD DISP=OLD,VOL=SER=F4S9AB,UNIT=SYSDA
 SCRATCH DSNAME=CLARKE.TEST,VOL=SYSDA=F4S9AB
 SCRATCH DSNAME=CLARKE.TEST.G0004V00,VOL=SYSDA=F4S9AB
 SCRATCH DSNAME=CLARKE.TEST.G0007V00,VOL=SYSDA=F4S9AB
