//CLARKEZ JOB (1011,1011),CLARK1,MSGCLASS=X,NOTIFY=CLARKE
//ZAP EXEC PGM=IMASPZAP
//SYSLIB   DD  DSN=SYS2.LINKLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
* PROBLEM: WHEN A DATA SET IS DELETED THEN ALLOCATED AND RECATLOGUED,
*          THE DATA SET IS DELETED AT THE END OF THE JOB.
*
* SOLUTION: ZAP SCHEDULER AS FOLLOWS:-
*
 NAME $JOLSH35 UJEISPDQ
 BASE 8128
 VER 848E 47F0,B380       BRANCH FOR MVS/F4
 REP 848E 4700            DON'T BRANCH
 IDRDATA SGIOCAT
