//CLARKEX JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE,
// CLASS=A
//JOBLIB    DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//GO  EXEC PGM=SNAPGM
//SNAP     DD  SYSOUT=*
//TPASS1  DD DSN=CLARKE.CVC.TESTPASS.ONE,DISP=(,PASS),
// UNIT=(TAPE,,DEFER)
//TPASS2  DD DSN=CLARKE.CVC.TESTPASS.TWO,DISP=(,PASS),
// UNIT=(TAPE,,DEFER),VOL=REF=*.TPASS1,LABEL=2
