//CLARKEX JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=JOL60,
// CLASS=A ,
//TES EXEC PGM=IEFQMRAW
//SYSUDUMP DD  SYSOUT=*
//CVCPDQ1  DD  DSN=TEST.CVC1,SPACE=(CYL,(2,2)),UNIT=SYSDA,
//             DISP=(,PASS)
//CVCPDQ2  DD  DSN=TEST.CVC2,SPACE=(CYL,(2,2)),UNIT=SYSDA,
//             DISP=(,PASS)
