//CLARKEF JOB (XXXX),CVC,MSGCLASS=X,NOTIFY=CLARKE
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN       DD  DSN=CLARKE.CVC.CNTL,UNIT=SYSDA,VOL=SER=F4S9AC,
// DISP=SHR,SPACE=(TRK,(10,10),RLSE)
//SYSIN DD *
 C I=IN,O=IN
