//CLARKEC JOB (1011,1011),CLARKE,MSGCLASS=X,NOTIFY=CLARKE
//ASM EXEC PGM=SHOWCAT
//STEPLIB   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
