//CLARKET  JOB CLASS=A,MSGCLASS=X,NOTIFY=CLARKE
//INITT   EXEC PGM=IEHINITT
//SYSPRINT  DD SYSOUT=*
//TAPE      DD UNIT=(TAPE,1,DEFER),DISP=(OLD,PASS),VOL=SER=JOLTSF
//SYSIN     DD *
//OBJ   EXEC   PGM=IKJEFT01,DYNAMNBR=100
//SYSTSPRT DD  SYSOUT=*
//DUMP     DD  SYSOUT=*
//TAPE     DD  DSN=JOLTSF.OBJ,DISP=(NEW,KEEP),
//             VOL=(,RETAIN,REF=*.INITT),
//             LABEL=(1,SL)
//SYSTSIN DD   *
PROF PRE (CLARKE)
EX MCC(TSTALLOC) 'JOLTSF' LIST PROMPT
DUMPSWA
