//CLARKEX JOB (1011,1011),CLARKE,MSGCLASS=X,NOTIFY=CLARKE
//RUN     EXEC PGM=XAUNIT
//STEPLIB DD DSN=CLARK1.DJD.LOAD,DISP=SHR
//SYSUDUMP  DD SYSOUT=*
