         MACRO
         IHAQDB
QDB      DSECT
QDBQDB   DS    CL4      ACRONYM OF QDB
QDBATTR  DS    CL2      QUEUE ATTRIBUTE
QDBDSLN  DS    FL2     QDB LENGTH
QDBNELMS DS    F       NUMBER OF ELEMENT OF QUEUE
QDBFELMP DS    A       PTR TO FIRST DSAB
QDBLELMP DS    A        PTR TO LAST ELEMENT
QDBFPTDS DS    H        FORWARD PTR DISPL
QDBBPTDS DS    H        BACKWARD PTR DISPL
QDBPRSZ  DS    H        PRTY FIELD SIZE
QDBPRDS  DS    H        PRTY FIELD DISPL
QDBRV002 DS    A        RESERVED
         MEND
