           MACRO
&NAME      JOLINST
.*&NAME    JOLINST  &TYPE=
.* THIS MACRO GENERATES A SERIES OF 'V' TYPE ADDRESS CONSTANTS
.*   CONTAINING THE ADDRESSES ETC OF ALL JOL INSTRUCTIONS PLUS
.*   A TABLE CONTAINING THE INSTRUCTIONS AS CONSTANTS FOR A LOOK PROCRD
.*         JOLINST (IF,04IF),(CATLG,CATALOGUE,05CAT)
         GBLC &TYPE                                            J51
           LCLA &THIS,&THISUBP
           TITLE 'LIST OF ALL JOL INSTRUCTIONS AND ADDRSSES OF RTNS'
*&TYPE.JOLINST CSECT
           DC A(*+12)
           DC A(16)
           DC A(JOLINSTE)
&THIS      SETA 1
.LOOP1     AIF (N'&SYSLIST(&THIS) LT 2).ERR1
&THISUBP   SETA 1
.LOOP2     DC  CL12'&SYSLIST(&THIS,&THISUBP)',A(#&SYSNDX&THIS)
&THISUBP   SETA &THISUBP+1
           AIF (&THISUBP LT N'&SYSLIST(&THIS)).LOOP2
&THIS      SETA &THIS+1
            SPACE
           AIF (&THIS LE N'&SYSLIST).LOOP1
JOLINSTE   EQU *
            SPACE
.* NOW GENERATE V CONSTANTS.
&THIS      SETA 1
.LOOP3     ANOP
&THISUBP   SETA N'&SYSLIST(&THIS)
#&SYSNDX&THIS EQU *
           DC  V(UJ&TYPE&SYSLIST(&THIS,&THISUBP))
           WXTRN UJ&TYPE&SYSLIST(&THIS,&THISUBP)
           SPACE
&THIS      SETA &THIS+1
           AIF (&THIS LE N'&SYSLIST).LOOP3
           MEXIT
.ERR1      MNOTE 8,'&SYSLIST(&THIS) REQUIRES AT LEAST 2 SUB-PARMS'
           MEND
