         TITLE 'PROGRAM DSECT AREA --- DECODED DCL PGM STATEMENT'
         AIF   ('&TYPE' EQ 'SCHED').PGMEQU
PGMDETS  DSECT                START OF PGM DECLARE STATEMENT DETAILS
         AGO .DOPGMS
.PGMEQU  ANOP
PGMDETS  EQU  *
.DOPGMS  ANOP
.NAME2   ANOP
#PGMDETS DS    H              LENGTH OF THE RECORD
         DS    H              SET TO ZERO
PGMTYPEI DS    CL1            SET TO 'E' FOR EXEC PGM
PGMLABEL DS    CL8            PGM DECLARE LABEL OR PGM NAME
PGMSTEP  DS    CL8            STEP NAME OUTPUT (REAL FROM RUN LABEL)
PGMADDR  DS    CL4            'VIRT' Ý 'REAL'
PGMSTMT  DS    CL4            PGM DECLARE STATEMENT NUMBER
PGMLEVEL DS    CL1            PGM LEVEL OF DECLARATION (MACROS)
PGMNEST  DS    CL1
PGMID    DS    CL8            DECLARE IDENTIFIER
PGM      DS    CL8            MODULE NAME TO BE EXECUTED
PGMSIZE  DS    CL5
PGMSIZEQ DS    CL1
PGMTIME1 DS    CL4
PGMTIME2 DS    CL4
PGMTIMEQ DS    CL1
PGMESTMT DS    CL4            EXECUTE STATEMENT NUMBER
PGMACCT  DS    CL8            PROGRAM ACCOUNT FIELD           76200
PGMPERFO DS    H              PERFORMANCE GROUP
PGMNODYN DS    H              NUMBER OF DYNAMIC DDS TO BE ALLOWED FOR
PGMNODDS DS    H              NUMBER OF DDCARDS WITH THIS PROGRAM
*                             DECLARE
PGMLEN   EQU   *-PGMDETS
           SPACE 3
         ORG    PGMNODDS
PGMNODD  DS    H
PGMDD1   DS    CL8            DDNAME
PGMUSE1  DS    CL1            WRITES READS ETC (SEE BELOW)
PGMDDNM1 DS    CL8            DSID
PGMDDMB1 DS    CL8            OVER-RIDING MEMBER.
         SPACE 3
         AIF   ('&TYPE' EQ 'SCHED').PGMEND
* THIS DSECT IS USED PRIMARILY IN UJC02PGM (DECODE PGM DCL)
* AND UJC24RUN (RUN STATEMENT)
PGMDDOV  DSECT
PGMDDNAM DS    CL8
PGMUSE   DS    CL1
PGMDSID  DS    CL8
PGMMBR   DS    CL8
PGMAFF   DS    CL8
         ORG   PGMDSID
PGMDSN   DS    CL52           NOTE ** MRB OR REL GEN LIVE HERE    75128
*                             IF 'A READS A.B(+1)'                75128
PGMPASSW DS    CL8            PASSWORD STORED HERE IF READS DSN/PASSW
PGMAFF2  DS    CL8                                                75311
         ORG
.PGMEND  ANOP
