           DC XL4'30008001',B'00000001'   2400
           DC XL4'30808001',B'00000010'   2400 1
           DC XL4'30C08001',B'00000011'   2400 2
           DC XL4'34008001',B'00000100'   2400 3
           DC XL4'34208001',B'00000101'   2400 4
           DC XL4'34C08003',B'00000110'   3400 7 TRACK
           DC XL4'34008003',B'00000111'   3400 PE
           DC XL4'34208003',B'00001000'   3400 DUAL DENSITY
           DC XL4'32108003',B'00001001'   3400 6250 BPI DUAL
           DC XL4'32008003',B'00001010'   3400 6250 BPI(NOT DUAL)
           DC XL4'78008003',B'00001100'   3400-9 TAPE CARTRIDGE 87150
           DC XL4'32008003',B'00001101'   3400-C TAPE CARTRIDGE 87150
* END TAPES
           DC XL4'30C02008',B'10000001'   2314 DISC
           DC XL4'30502009',B'10000010'   3330 DISC
           DC XL4'30002001',B'10000011'   2311 DISC
           DC XL4'30402002',B'11000100'   2301 DRUM
           DC XL4'30402004',B'10000101'   2302 DISC
           DC XL4'30502006',B'11000110'   2305-1 FIXED HEAD DISK
           DC XL4'30502007',B'11000111'   2305-2 FIXED HEAD DISK
           DC XL4'3050200A',B'10001000'   3340 DISK UNITS
           DC XL4'3040200A',B'10001000'   3340 DISK UNITS
           DC XL4'30702009',B'10001001'   3330-1 (MOD 2'S)
MVS3330    DC XL4'3070200D',B'10001001'   3330-1 (MOD 2'S MVS)
           DC XL4'30502009',B'10000010'   3330 NORMAL
           DC XL4'30582009',B'10001100'   3330 VIRTUAL
           DC XL4'3050200B',B'10001011'   3350 DISK UNITS
           DC XL4'3010200C',B'10001101'   3375 DISKS UNIT
           DC XL4'3010200E',B'10001110'   3380 DISK UNITS
           DC XL4'3010200F',B'10010000'   3390 DISK UNITS         J60
           DC XL4'3010200F',B'10010001'   3390-2 DISK UNITS       J60
           DC XL4'3010200F',B'10010010'   3390-3 DISK UNITS       J60
           DC XL4'30502085',B'10001111'   F6421 (FACOM DISKS)
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
           DC XL4'00000000',B'10001000'   ZAP AREA
