//CLARKEY JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE,REGION=1000K
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST,TEST' REGION=512K
//SYSLIB    DD DSN=CLARKE.JOL40.OBJ,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB(P27NEW)
  INCLUDE SYSLIB(P27MBAR)
  INCLUDE SYSLIB(P27GETXT)
  INCLUDE SYSLIB(P27POP)
  INCLUDE SYSLIB(P27TBA)
  INCLUDE SYSLIB(P27PRMS)
  ENTRY  UJP27PNL
  NAME P27NEW(R)
//
  INCLUDE SYSLIB(P27POP)
  INCLUDE SYSLIB(P27INIT)
  INCLUDE SYSLIB(P27GETXT)
  ENTRY  UJP27POP
  NAME P27POP(R)
//
//COMPR   EXEC PGM=IEBCOPY,REGION=1000K
//SYSUT1    DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT2    DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD DUMMY
