//MEL371F JOB (XXXX),CVC,MSGCLASS=X,NOTIFY=CLARKE
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN1      DD  DSN=CLARKE.JOL40.ASM,DISP=SHR
//OUT1     DD  DSN=CLARKE.JOL40B.ASM,DISP=SHR
//SYSIN DD *
 C I=IN1,O=OUT1
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//IN1      DD  DSN=CLARKE.JOL35.ASM,DISP=SHR
//OUT1     DD  DSN=CLARKE.JOL35B.ASM,DISP=SHR
//SYSIN DD *
 C I=IN1,O=OUT1
/*
