//CLARKEF JOB (XXXX),CVC,MSGCLASS=X,NOTIFY=CLARKE
//        EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//ENQ      DD  DSN=CLARKE.JOL.OBJ,DISP=OLD
//IN1      DD  DSN=CLARKE.JOL35.LOAD,DISP=SHR
//OUT1     DD  DSN=SYS2.LINKLIB,DISP=SHR
//SYSIN DD *
 C I=IN1,O=OUT1
 SELECT MEMBER=(($SCHED35,$JOLSH35,R))
/*
