//CLARKEE  JOB A,CLARKE,NOTIFY=CLARKE,MSGLEVEL=1,REGION=4048K,
// MSGCLASS=X
//COMP1 EXEC CCALG,SEQ='' , CVPARM='-WV '    -I '
//CV.SRC DD DSN=CLARKE.JOL.C(P18REAL),DISP=SHR
//CV.CVC DD    *
*/
  /*
#include "stdio";
#include "string";
#include <stdio>;
