//CLARKEJ JOB (NONE),CVC,CLASS=A,NOTIFY=CLARKE,MSGCLASS=X
// EXEC PGM=TEMPNAME
//SYSUDUMP DD SYSOUT=*
// EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD DSN=CLARKE.SYSUT2,DISP=SHR
 PRINT INFILE(SYSUT1) OUTFILE(SYSPRINT) DUMP COUNT(10)
