//CLARKEG  JOB  MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=CLARKE
//         EXEC PGM=JSDFLPDK  FLOPPY
//SYSPRINT DD   SYSOUT=*
//I1       DD   DISP=(SHR,PASS),DSN=CLARKE.FB132
//SYSUT2   DD   UNIT=00C
//SYSIN    DD   *
     INPUT I1
     CNVDF PANEL
/*   FEED
