//CLARKEF  JOB  MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=CLARKE
//         EXEC PGM=JSDFLPDK  FLOPPY
//SYSPRINT DD   SYSOUT=*
//SYSUT2   DD   UNIT=00C
//SYSIN    DD   *
     INITF VOL=CCS001,F
     INITF VOL=CCS002,F
     INITF VOL=CCS003,F
     INITF VOL=CCS004,F
     INITF VOL=CCS005,F
     INITF VOL=CCS006,F
     INITF VOL=CCS007,F
     INITF VOL=CCS008,F
     INITF VOL=CCS009,F
     INITF VOL=CCS010,F
     INITF VOL=CCS011,F
     INITF VOL=CCS012,F
