//CLARKEG JOB (ACCT),CVC,MSGCLASS=X,NOTIFY=CLARKE
// EXEC PGM=IEFBR14
//DD2 DD DSN=CLARKE.TEST(+2),DISP=(,CATLG),UNIT=SYSDA,
// SPACE=(TRK,(0,0)),DCB=CLARKE.CVC.CNTL
//DD1 DD DSN=CLARKE.TEST.G0007V00,DISP=(OLD,DELETE),
// VOL=REF=*.DD2
//DD3 DD DSN=CLARKE.TEST(+3),DISP=(,CATLG),UNIT=SYSDA,
// SPACE=(TRK,(0,0)),DCB=CLARKE.CVC.CNTL
