//CLARKEG JOB (ACCT),CVC,MSGCLASS=X,NOTIFY=CLARKE
// EXEC PGM=IEFBR14
//DD1 DD DSN=CLARKE.GDG.TEST(+1),DISP=(,CATLG),UNIT=SYSDA,
// SPACE=(TRK,(0,0)),DCB=CLARKE.CVC.CNTL
//DD2 DD DSN=CLARKE.GDG.TEST(+2),DISP=(,CATLG),UNIT=SYSDA,
// SPACE=(TRK,(0,0)),DCB=CLARKE.CVC.CNTL
//DD3 DD DSN=CLARKE.GDG.TEST(+3),DISP=(,CATLG),UNIT=SYSDA,
// SPACE=(TRK,(0,0)),DCB=CLARKE.CVC.CNTL
