//CLARKEG  JOB MSGCLASS=X,NOTIFY=CLARKE
//STEP1   EXEC PGM=JQHGEM1,REGION=192K
//*  DEFINES GEM PROJECT CATALOG AND
//*      REGISTER TWO GEM LIBRARIES
//GEMPRJ    DD DSN=CLARKE.GEM.JOL,UNIT=SYSDA,VOL=SER=F4S9AC,
//      SPACE=(TRK,5,,CONTIG),DCB=DSORG=DA,DISP=(NEW,CATLG,DELETE)
//SYSPRINT  DD SYSOUT=X
//SYSIN     DD *
- PROJECT   JOL,NEW,OWNER=CLARKE
- CATLG     CLARKE.JOL35.ASM,NEW,DSORG=GEM,VOL=F4S9AC,UNIT=SYSDA
- CATLG     CLARKE.JOL36.ASM,NEW,DSORG=GEM,VOL=F4S9AC,UNIT=SYSDA
- END
/*
//STEP2   EXEC PGM=JQHGEM2,REGION=192K
//*  ALLOCATES AND INITIALIZES TWO GEM LIBRARIES
//GEMPRJ    DD DSN=CLARKE.GEM.JOL,DISP=SHR
//ABC       DD DYNAM
//SYSPRINT  DD SYSOUT=X
//SYSIN     DD *
- LIBRARY   CLARKE.JOL35.ASM,NEW,OWNER=CLARKE,                         *
-           BLKNO=4,CYL=20
- LIBRARY   CLARKE.JOL36.ASM,NEW,OWNER=CLARKE,                         *
-           BLKNO=8,CYL=5
- END
/*
//*   GEM PROJECT CATALOG NOW NEEDS TO BE REGISTERED IN 0.4 OF PFD
//*      AND GEM WOULD BE USABLE
//
