//CLARKEI JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE
//ASM EXEC PGM=IEHLIST
//SYSPRINT DD  SYSOUT=*
//DD1      DD  DISP=OLD,VOL=SER=SARES1,UNIT=3390
   LISTPDS DSNAME=CLARKE.JOL35.ASM,VOL=3390=SARES1
   LISTPDS DSNAME=CLARKE.JOL35.ASM,VOL=3390=SARES1,FORMAT
