//T92CVCX JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=T92CVC,
// CLASS=A,USER=????????,PASSWORD=????????
//*MAIN LINES=999
//GO  EXEC PGM=XAUNIT2
//SYSUDUMP DD  SYSOUT=*
//STEPLIB   DD DSN=T41.JOLXA.LOAD,DISP=SHR
//TTEPLIB   DD DSN=SYS1.JOL.TEST.LINKLIB,DISP=SHR
