//CLARKEC JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//JOL40OBJ  DD DSN=CLARKE.JOL40.OBJ,DISP=OLD
//JOL40LD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE JOL40OBJ(UJC00MN)
  INCLUDE JOL40OBJ(CJOLINST)
  INCLUDE JOL40OBJ(UJC01JOB)
  INCLUDE JOL40OBJ(UJC02PGM)
  INCLUDE JOL40OBJ(UJC03DS)
  INCLUDE JOL40OBJ(COMPSUBS)
  INCLUDE JOL40OBJ(UJS02XA)
  NAME UJC00MN(R)
