//CLARKE2 JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='XREF,LIST,TEST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL60.OBJ,DISP=OLD
//*YSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL60.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(UJCOMMON)
  ENTRY JOLCOM
  PAGE  JOLCOM
  NAME  UJCOMMON(R)
