//CLARKEL JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=JOL60
//LKED    EXEC PGM=IEWL,PARM='AC=0,LET,XREF,LIST,TEST',
// REGION=1024K
//* JOL60     DD DSN=CLARKE.JOL.OBJ,DISP=OLD
//JOL60     DD DSN=JOLDEV.JOL60.OBJ,DISP=OLD
//*LOAD35    DD DSN=CLARKE.JOL60.LOAD,DISP=SHR
//SYSLIB    DD DSN=JOLDEV.JOL60.OBJ,DISP=SHR
//OBJ       DD DSN=JOLDEV.JOL60.OBJ,DISP=SHR
//SYSLMOD   DD DSN=JOLDIST.JOL60.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE JOL60($JOLDY60)
           INCLUDE   OBJ(UJD03ERR)
  INCLUDE OBJ(DYNDUMP)
           SETCODE   AC(0)
  NAME $JOLDY60(R)
  INCLUDE JOL60($DYNMN60)
           SETCODE   AC(1)
  NAME $DYNMN60(R)
           INCLUDE   OBJ($DYNSH60)
           SETCODE   AC(1)
           INCLUDE   OBJ(UJD03DS1)
           INCLUDE   OBJ(UJD03ERR)
           INCLUDE   OBJ(UJD05CAT)
           INCLUDE   OBJ(UJD06UNC)
           INCLUDE   OBJ(UJD07KEE)
           INCLUDE   OBJ(UJD08SCR)
           INCLUDE   OBJ(UJD09DEL)
           INCLUDE   OBJ(UJD30VOL)
           INCLUDE   OBJ(UJD48TAL)
           INCLUDE   OBJ(UJE04IF)
           INCLUDE   OBJ(UJD14FRE)
           INCLUDE   OBJ(UJD20RUN)
           INCLUDE   OBJ(UJD21ALL)
           INCLUDE   OBJ(UJD21DMP)
           INCLUDE   OBJ(UJE21DMP)
  *        INCLUDE   OBJ(UJTNUMV)
           INCLUDE   OBJ(UJE50RD)
           INCLUDE   OBJ(UJD01JOB)
           INCLUDE   OBJ(UJCTKN)
           INCLUDE   OBJ(UJDDYNC)
           INCLUDE   OBJ(UJD03ASK)
           INCLUDE   OBJ(UJD49VOL)
           INCLUDE   OBJ(UJE22UPD)
           INCLUDE   OBJ(SRCHQDB)
           INCLUDE   OBJ(UJD24PDQ)
           INCLUDE   OBJ(SRCHTIOT)
  INCLUDE OBJ(DYNDUMP)
           NAME      $DYNSH60(R)
//SYSLINO   DD *
  INCLUDE JOL60($DYNSH60)
  INCLUDE JOL60(UJEJOBQ)
  INCLUDE JOL60(UJE22UPD)
  INCLUDE JOL60(UJE03DS)
  INCLUDE JOL60(SRCHQDB)
* INCLUDE LOAD35($SCHED35)
  NAME $DYNSH60(R)
//
  INCLUDE JOL60(DYNDUMP)
