//CLARKEA JOB (ACCOUNT),CLARKE,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//SYSLIB    DD DSN=CLARKE.JOL40.OBJ,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB(UJG01JOB)
  INCLUDE SYSLIB(UJG01SPL)
  NAME UJG01JOB(R)
