//CLARKE5 JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//SYSLIB    DD DSN=CLARKE.JOL60.OBJ,DISP=OLD
//SYSLMOD   DD DSN=CLARKE.JOL60.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSLIN    DD *
  ENTRY   UJI00MN
  INCLUDE SYSLIB(UJI00MN)
  NAME    UJI00MN(R)
