//CLARKEL JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='REUS,XREF,LIST,LET,TEST',
// REGION=2048K
//SYSLIB3   DD DSN=CLARKE.JOL60.OBJ,DISP=SHR
//SYSLIB    DD DSN=CLARKE.JOL60.OBJ,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL60.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB3(NOTHING)
  ALIAS UJA98SET
  ALIAS UJA99SET
  NAME NOTHING(R)
