//CLARKEX JOB (JOL),'CVC',MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST,AC=1'
//SYSLIB1   DD DSN=CLARKE.JOL40.OBJ,DISP=OLD
//SYSLIB    DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1($JOLMN40)
  NAME  $MONIT40(R)
