//CLARKEX JOB (CLARKE),'C.CLARKE',MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST,AC=1'
//SYSLIB1   DD DSN=CLARKE.JOL.OBJ,DISP=OLD
//SYSLIB2   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSLIB    DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//*YSLMOD   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSLMOD   DD DSN=SYS2.LINKLIB,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1($JOLMN35)
  ALIAS $MONIT35
  NAME  $JOLMN35(R)
