//CLARKE6 JOB (ACCOUNT),CVC,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//JOL35OBJ  DD DSN=CLARKE.JOL.OBJ,DISP=OLD
//JOL36OBJ  DD DSN=CLARKE.JOL36.OBJ,DISP=OLD
//JOL35LOD  DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//*REPLACE UJP52CHR
//SYSLIN    DD *
  INCLUDE JOL35OBJ(UJP00MN)
  REPLACE PJOLINST
  REPLACE UJP60REA
  REPLACE UJP61WRI
  INCLUDE JOL35LOD(OLDP00)
  INCLUDE JOL35OBJ(PJOLINST)
  INCLUDE JOL35OBJ(UJP52FST)
  INCLUDE JOL36OBJ(UJP17OPN)
  INCLUDE JOL36OBJ(UJP26ENQ)
  INCLUDE JOL36OBJ(UJP26DEQ)
  INCLUDE JOL36OBJ(JOLENQ)
  CHANGE  UJP52CHR(UJP52OLD)
  INCLUDE JOL35LOD(OLDP00)
  ENTRY UJP00MN
  NAME  UJP00MN(R)
