//CLARKE6 JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL36.OBJ,DISP=OLD
//SYSLIB2   DD DSN=CLARKE.JOL34.LOAD,DISP=SHR
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL36.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(UJP17OPN)
  INCLUDE SYSLIB1(UJP26ENQ)
  INCLUDE SYSLIB1(UJP26DEQ)
  INCLUDE SYSLIB1(JOLENQ)
  ALIAS P18TEOF
  ALIAS UJP18GET
  ALIAS UJP19PUT
  ALIAS UJP17OPN
  ALIAS UJP60REA
  ALIAS UJP61WRI
  ALIAS UJP26DEQ
  NAME  UJP26ENQ(R)
