//CLARKE7 JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL36.OBJ,DISP=OLD
//SYSLIB2   DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSLIB    DD DSN=CLARKE.JOL.OBJ,DISP=OLD
//SYSLMOD   DD DSN=CLARKE.JOL36.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(UJP52CHR)
  ENTRY UJPREAD
  NAME  UJPREAD(R)
/*
