//CLARKE6 JOB (ACCOUNT),CAST,MSGCLASS=X,NOTIFY=CLARKE
//LKED    EXEC PGM=IEWL,PARM='RENT,REUS,XREF,LIST',REGION=512K
//SYSLIB1   DD DSN=CLARKE.JOL40.OBJ,DISP=OLD
//SYSLIB    DD DSN=SYS1.PLIBASE,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB1(UJV00RD)
  ENTRY UJV00RD
  NAME  UJV00RD(R)
