//CLARKEB  JOB (0000,0000),CVC,MSGCLASS=X,NOTIFY=CLARKE
//*JOBCAT DD DSN=SYS1.PROJ01.UCAT,DISP=SHR
// EXEC PLIXC,
// PARM=('MARGINS(1,72,0),NEST,OBJ,SOURCE,LIST,MAP,NOGOSTMT,STMT',
// 'MDECK,NOCOMPILE,OPT(0),MACRO'),REGION=300K
//SYSPRINT DD SYSOUT=*
//*SYSPUNCH DD SYSOUT=*
//SYSPUNCH DD  DSN=CLARKE.PLI.PUN,DISP=(,CATLG),
//  SPACE=(CYL,(5,1),RLSE),DCB=BLKSIZE=800,UNIT=SYSDA
//SYSLIB DD DSN=CLARKE.JOL40.NEW2.PLI,DISP=SHR
//SYSIN  DD DSN=CLARKE.JOL40.SOURCE(JCLTOJOL),DISP=SHR
