//CLARKEP JOB (0000,0000),NAME,MSGCLASS=A,NOTIFY=CLARKE
// EXEC PLIXCL,
//     PARM.PLI='NOAIM,XREF,MAR(1,72,73),OF,SZ(450K),LIST,MAP',
//     REGION.PLI=512K,PARM.LKED='MAP,LIST,SIZE=(450000,100000)',
//     REGION.LKED=512K
//SYSPRINT DD SYSOUT=*
X:PROC OPTIONS(MAIN);
  DCL Y(2) CHAR(1) BASED(P);
  DCL Z    CHAR(1) STATIC;
  DCL (P,Q) PTR STATIC;
  P=ADDR(Z);
  Q=ADDR(Y(2));
DCL I BIN FIXED STATIC INIT(1);
  Q=ADDR(Y(I));
END;
//LKED.SYSPRINT DD SYSOUT=*
