//CLARKEB  JOB  MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=CLARKE
//         EXEC PGM=IMASPZAP
//SYSPRINT DD   SYSOUT=X
//SYSLIB   DD   DSN=SYS1.SVCLIB,DISP=SHR
//SYSIN    DD   *
     DUMP KBC0194A KBC0194C
     DUMPT KBC0194A KBC0194C
