//CLARKEX JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE,
// CLASS=A
//JOBLIB    DD DSN=CLARKE.JOL35.LOAD,DISP=SHR
//GO  EXEC PGM=IEFBR14
//TPASS1  DD DSN=CLARKE.TEST.XXX,DISP=(OLD,PASS)
//GO  EXEC PGM=IEFBR14
//TPASS2  DD DSN=CLARKE.TEST.XXX,DISP=(OLD,PASS),
// VOL=REF=*.GO.TPASS1
//TWOONPDQ  EXEC PGM=SNAPGM
//SNAP     DD  SYSOUT=*
//GO  EXEC PGM=IEFBR14
//TPASS1  DD DSN=CLARKE.TEST.XXX,DISP=(OLD,DELETE)
//DELETED  EXEC PGM=SNAPGM
//SNAP     DD  SYSOUT=*
//GO  EXEC PGM=IEFBR14
//TPASS1  DD DSN=CLARKE.TEST.XXX,DISP=(NEW,PASS),UNIT=SYSDA,
// SPACE=(TRK,(1,1))
//ALLOC  EXEC PGM=SNAPGM
//SNAP     DD  SYSOUT=*
//CAT EXEC PGM=IEFBR14
//TPASS1  DD DSN=CLARKE.TEST.XXX,DISP=(OLD,CATLG)
//AFTERCAT  EXEC PGM=SNAPGM
//SNAP     DD  SYSOUT=*
