//CLARKEE  JOB A,CLARKE,NOTIFY=CLARKE,MSGLEVEL=1,
// MSGCLASS=X
//COMP1 EXEC PGM=PRTQDB
//SYSPRINT DD SYSOUT=X,OUTLIM=2500
//STEPLIB DD DSN=CLARKE.JOL36.LOAD,DISP=SHR
//X DD DSN=CLARKE.TEST,DISP=SHR
