//CLARKEI JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE
//ASM EXEC PGM=IEHPROGM
//SYSPRINT DD  SYSOUT=*
//DD1      DD  DISP=OLD,UNIT=SYSDA,VOL=SER=F4W300
//DD2      DD  DISP=OLD,UNIT=SYSDA,VOL=SER=F4W301
 SCRATCH  VTOC,SYS,VOL=SYSDA=F4W300
 SCRATCH  VTOC,SYS,VOL=SYSDA=F4W301
