//CLARKEX  JOB (),MSGCLASS=X,MSGLEVEL=(1,1),REGION=4096K,
// COND=((2000,LE),(16,EQ))
//* 'JOL':-VERSION 6.0  ON FRIDAY    03 DECEMBER  2010 AT 04.44
//IEBGENER   EXEC PGM=IEBGENER
//SYSUT1   DD  DSN=SYS1.MACLIB(CALL),DISP=(SHR,PASS),UNIT=(3390),VOL=(,+
//             RETAIN,SER=(SARES1))
//SYSUT2   DD  PATH='/LLL/JJ',PATHOPTS=(OWRONLY,OCREAT),PATHDISP=(KEEP,+
//             KEEP)
//SYSIN    DD  DUMMY,DISP=(SHR)
//SYSPRINT DD  SYSOUT=(X)
