//CLARKE2 JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=CLARKE
//ASM EXEC PGM=ASMBLR,PARM='NODECK,OBJ,XREF(SHORT),LIST'
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR,DCB=BLKSIZE=19040
//         DD  DSN=SYS1.FMODGEN,DISP=SHR
//         DD  DSN=CLARKE.JOL35.MACLIB,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,SPACE=(CYL,(2,2)),UNIT=SYSDA
//SYSUT2   DD  DSN=&&SYSUT2,SPACE=(CYL,(2,2)),UNIT=SYSDA
//SYSUT3   DD  DSN=&&SYSUT3,SPACE=(CYL,(2,2)),UNIT=SYSDA
//SYSGO DD DSN=CLARKE.JOL.OBJ(TSCRCH),DISP=OLD
//SYSPRINT DD  SYSOUT=*
         TITLE 'TIOT SCAN SOUBROUTINE'
* THIS SUBROUTINE SEARCHES THE TIOT FOR A SPECIFIED DDNAME
*  WHOSE ADDRESS IS PASSED IN REGISTER 1
         GENSAVE CSECT=TEST
         LA    R1,=CL8'SYSPRINT'
         CALL  SRCHTIOT
         LTR   R15,R15
         BNZ   ERR1
         WTO    'SYSPRINT RETURNED 0'
         B     NEXT
ERR1     WTO    'SYSPRINT RETURNED 4'
NEXT     LA    R1,=CL8'XXXXXXXX'
         EXTRN SRCHTIOT
         CALL  SRCHTIOT
         LTR   R15,R15
         BNZ   ERR2
         WTO    'XXXXXXXX RETURNED 0'
         B     RET
ERR2     WTO    'XXXXXXXX RETURNED 4'
         STH   R15,RETN
RET      GENRETN
RETN     DS    H
         LTORG
         END
//LKED    EXEC PGM=IEWL,PARM='RENT,TEST,REUS,XREF,LIST',REGION=512K
//SYSLIB    DD DSN=CLARKE.JOL.OBJ,DISP=SHR
//SYSLMOD   DD DSN=CLARKE.JOL36.LOAD(TSCRCH),DISP=SHR
//SYSUT1    DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,2))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
  INCLUDE SYSLIB(TSCRCH)
// EXEC PGM=TSCRCH
//STEPLIB   DD DSN=CLARKE.JOL36.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
